zhengwang721/ASF/sam0/utils/cmsis/samd21/include/component/component_ptc.h
/**
 * \file
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_PTC_COMPONENT_
#define _SAMD20_PTC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PTC */
/* ========================================================================== */
/** \addtogroup SAMD20_PTC Peripheral Touch Controller */
/*@{*/

#define REV_PTC                     0x101

/* -------- PTC_CTRLA : (PTC Offset: 0x00) (R/W  8) Control Register A -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  SWRST:1;          /*!< bit:      0  Software Reset                     */
    uint8_t  ENABLE:1;         /*!< bit:      1  Enable                             */
    uint8_t  RUNSTDBY:1;       /*!< bit:      2  Run during Standby                 */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTRLA_OFFSET            0x00         /**< \brief (PTC_CTRLA offset) Control Register A */
#define PTC_CTRLA_RESETVALUE        0x00         /**< \brief (PTC_CTRLA reset_value) Control Register A */

#define PTC_CTRLA_SWRST_Pos         0            /**< \brief (PTC_CTRLA) Software Reset */
#define PTC_CTRLA_SWRST             (0x1u << PTC_CTRLA_SWRST_Pos)
#define PTC_CTRLA_ENABLE_Pos        1            /**< \brief (PTC_CTRLA) Enable */
#define PTC_CTRLA_ENABLE            (0x1u << PTC_CTRLA_ENABLE_Pos)
#define PTC_CTRLA_RUNSTDBY_Pos      2            /**< \brief (PTC_CTRLA) Run during Standby */
#define PTC_CTRLA_RUNSTDBY          (0x1u << PTC_CTRLA_RUNSTDBY_Pos)
#define PTC_CTRLA_MASK              0x07u        /**< \brief (PTC_CTRLA) MASK Register */

/* -------- PTC_STATUS : (PTC Offset: 0x01) (R/   8) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  :7;               /*!< bit:  0.. 6  Reserved                           */
    uint8_t  SYNCBUSY:1;       /*!< bit:      7  Synchronization Busy               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_STATUS_OFFSET           0x01         /**< \brief (PTC_STATUS offset) Status Register */
#define PTC_STATUS_RESETVALUE       0x00         /**< \brief (PTC_STATUS reset_value) Status Register */

#define PTC_STATUS_SYNCBUSY_Pos     7            /**< \brief (PTC_STATUS) Synchronization Busy */
#define PTC_STATUS_SYNCBUSY         (0x1u << PTC_STATUS_SYNCBUSY_Pos)
#define PTC_STATUS_MASK             0x80u        /**< \brief (PTC_STATUS) MASK Register */

/* -------- PTC_CTRLB : (PTC Offset: 0x04) (R/W  8) Control Register B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  PRSC:2;           /*!< bit:  0.. 1  Clock Prescaler                    */
    uint8_t  FREERUN:1;        /*!< bit:      2  Freerunning PTC                    */
    uint8_t  ADRS:1;           /*!< bit:      3  ADC Resolution Select              */
    uint8_t  :4;               /*!< bit:  4.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTRLB_OFFSET            0x04         /**< \brief (PTC_CTRLB offset) Control Register B */
#define PTC_CTRLB_RESETVALUE        0x00         /**< \brief (PTC_CTRLB reset_value) Control Register B */

#define PTC_CTRLB_PRSC_Pos          0            /**< \brief (PTC_CTRLB) Clock Prescaler */
#define PTC_CTRLB_PRSC_Msk          (0x3u << PTC_CTRLB_PRSC_Pos)
#define PTC_CTRLB_PRSC(value)       ((PTC_CTRLB_PRSC_Msk & ((value) << PTC_CTRLB_PRSC_Pos)))
#define PTC_CTRLB_FREERUN_Pos       2            /**< \brief (PTC_CTRLB) Freerunning PTC */
#define PTC_CTRLB_FREERUN           (0x1u << PTC_CTRLB_FREERUN_Pos)
#define PTC_CTRLB_ADRS_Pos          3            /**< \brief (PTC_CTRLB) ADC Resolution Select */
#define PTC_CTRLB_ADRS              (0x1u << PTC_CTRLB_ADRS_Pos)
#define PTC_CTRLB_MASK              0x0Fu        /**< \brief (PTC_CTRLB) MASK Register */

/* -------- PTC_EVCTRL : (PTC Offset: 0x05) (R/W  8) Event Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  STCONVEI:1;       /*!< bit:      0  Start Conversion Event Input       */
    uint8_t  EOCEO:1;          /*!< bit:      1  End of Conversion Event Output     */
    uint8_t  WCOMPEO:1;        /*!< bit:      2  Window Comparator Event Output     */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_EVCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_EVCTRL_OFFSET           0x05         /**< \brief (PTC_EVCTRL offset) Event Control Register */
#define PTC_EVCTRL_RESETVALUE       0x00         /**< \brief (PTC_EVCTRL reset_value) Event Control Register */

#define PTC_EVCTRL_STCONVEI_Pos     0            /**< \brief (PTC_EVCTRL) Start Conversion Event Input */
#define PTC_EVCTRL_STCONVEI         (0x1u << PTC_EVCTRL_STCONVEI_Pos)
#define PTC_EVCTRL_EOCEO_Pos        1            /**< \brief (PTC_EVCTRL) End of Conversion Event Output */
#define PTC_EVCTRL_EOCEO            (0x1u << PTC_EVCTRL_EOCEO_Pos)
#define PTC_EVCTRL_WCOMPEO_Pos      2            /**< \brief (PTC_EVCTRL) Window Comparator Event Output */
#define PTC_EVCTRL_WCOMPEO          (0x1u << PTC_EVCTRL_WCOMPEO_Pos)
#define PTC_EVCTRL_MASK             0x07u        /**< \brief (PTC_EVCTRL) MASK Register */

