zhengwang721/ASF/sam0/utils/cmsis/samd21/include/component/component_ptc.h
/* -------- PTC_CTSCTRLC : (PTC Offset: 0x0D) (R/W  8) CTS Control Register C -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  ADAS:3;           /*!< bit:  0.. 2  ADC Accumulation Number Select     */
    uint8_t  :4;               /*!< bit:  3.. 6  Reserved                           */
    uint8_t  STCONV:1;         /*!< bit:      7  Start Conversion                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTSCTRLC_OFFSET         0x0D         /**< \brief (PTC_CTSCTRLC offset) CTS Control Register C */
#define PTC_CTSCTRLC_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLC reset_value) CTS Control Register C */

#define PTC_CTSCTRLC_ADAS_Pos       0            /**< \brief (PTC_CTSCTRLC) ADC Accumulation Number Select */
#define PTC_CTSCTRLC_ADAS_Msk       (0x7u << PTC_CTSCTRLC_ADAS_Pos)
#define PTC_CTSCTRLC_ADAS(value)    ((PTC_CTSCTRLC_ADAS_Msk & ((value) << PTC_CTSCTRLC_ADAS_Pos)))
#define PTC_CTSCTRLC_STCONV_Pos     7            /**< \brief (PTC_CTSCTRLC) Start Conversion */
#define PTC_CTSCTRLC_STCONV         (0x1u << PTC_CTSCTRLC_STCONV_Pos)
#define PTC_CTSCTRLC_MASK           0x87u        /**< \brief (PTC_CTSCTRLC) MASK Register */

/* -------- PTC_YSEL : (PTC Offset: 0x10) (R/W 16) Y Line Select Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t YSEL:16;          /*!< bit:  0..15  Y Line Selection                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_YSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_YSEL_OFFSET             0x10         /**< \brief (PTC_YSEL offset) Y Line Select Register */
#define PTC_YSEL_RESETVALUE         0x0000       /**< \brief (PTC_YSEL reset_value) Y Line Select Register */

#define PTC_YSEL_YSEL_Pos           0            /**< \brief (PTC_YSEL) Y Line Selection */
#define PTC_YSEL_YSEL_Msk           (0xFFFFu << PTC_YSEL_YSEL_Pos)
#define PTC_YSEL_YSEL(value)        ((PTC_YSEL_YSEL_Msk & ((value) << PTC_YSEL_YSEL_Pos)))
#define PTC_YSEL_MASK               0xFFFFu      /**< \brief (PTC_YSEL) MASK Register */

/* -------- PTC_XSEL : (PTC Offset: 0x12) (R/W 16) X Line Select Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t XSEL:16;          /*!< bit:  0..15  X Line Selection                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_XSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_XSEL_OFFSET             0x12         /**< \brief (PTC_XSEL offset) X Line Select Register */
#define PTC_XSEL_RESETVALUE         0x0000       /**< \brief (PTC_XSEL reset_value) X Line Select Register */

#define PTC_XSEL_XSEL_Pos           0            /**< \brief (PTC_XSEL) X Line Selection */
#define PTC_XSEL_XSEL_Msk           (0xFFFFu << PTC_XSEL_XSEL_Pos)
#define PTC_XSEL_XSEL(value)        ((PTC_XSEL_XSEL_Msk & ((value) << PTC_XSEL_XSEL_Pos)))
#define PTC_XSEL_MASK               0xFFFFu      /**< \brief (PTC_XSEL) MASK Register */

/* -------- PTC_YEN : (PTC Offset: 0x14) (R/W 16) Y Line Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t YEN:16;           /*!< bit:  0..15  Y Line Enable                      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_YEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_YEN_OFFSET              0x14         /**< \brief (PTC_YEN offset) Y Line Enable Register */
#define PTC_YEN_RESETVALUE          0x0000       /**< \brief (PTC_YEN reset_value) Y Line Enable Register */

#define PTC_YEN_YEN_Pos             0            /**< \brief (PTC_YEN) Y Line Enable */
#define PTC_YEN_YEN_Msk             (0xFFFFu << PTC_YEN_YEN_Pos)
#define PTC_YEN_YEN(value)          ((PTC_YEN_YEN_Msk & ((value) << PTC_YEN_YEN_Pos)))
#define PTC_YEN_MASK                0xFFFFu      /**< \brief (PTC_YEN) MASK Register */

/* -------- PTC_XEN : (PTC Offset: 0x16) (R/W 16) X Line Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t XEN:16;           /*!< bit:  0..15  X Line Enable                      */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_XEN_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_XEN_OFFSET              0x16         /**< \brief (PTC_XEN offset) X Line Enable Register */
#define PTC_XEN_RESETVALUE          0x0000       /**< \brief (PTC_XEN reset_value) X Line Enable Register */

#define PTC_XEN_XEN_Pos             0            /**< \brief (PTC_XEN) X Line Enable */
#define PTC_XEN_XEN_Msk             (0xFFFFu << PTC_XEN_XEN_Pos)
#define PTC_XEN_XEN(value)          ((PTC_XEN_XEN_Msk & ((value) << PTC_XEN_XEN_Pos)))
#define PTC_XEN_MASK                0xFFFFu      /**< \brief (PTC_XEN) MASK Register */

/* -------- PTC_CCCAL : (PTC Offset: 0x18) (R/W 16) CTS Compensation Capacitor Calibration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t CCA:4;            /*!< bit:  0.. 3  Compensation Capacitor Accurate Value */
    uint16_t CCF:4;            /*!< bit:  4.. 7  Compensation Capacitor Fine Value  */
    uint16_t CCC:4;            /*!< bit:  8..11  Compensation Capacitor Coarse Value */
    uint16_t CCR:2;            /*!< bit: 12..13  Compensation Capacitor Rough Value */
    uint16_t :2;               /*!< bit: 14..15  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_CCCAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CCCAL_OFFSET            0x18         /**< \brief (PTC_CCCAL offset) CTS Compensation Capacitor Calibration Register */
#define PTC_CCCAL_RESETVALUE        0x0000       /**< \brief (PTC_CCCAL reset_value) CTS Compensation Capacitor Calibration Register */

#define PTC_CCCAL_CCA_Pos           0            /**< \brief (PTC_CCCAL) Compensation Capacitor Accurate Value */
#define PTC_CCCAL_CCA_Msk           (0xFu << PTC_CCCAL_CCA_Pos)
#define PTC_CCCAL_CCA(value)        ((PTC_CCCAL_CCA_Msk & ((value) << PTC_CCCAL_CCA_Pos)))
#define PTC_CCCAL_CCF_Pos           4            /**< \brief (PTC_CCCAL) Compensation Capacitor Fine Value */
#define PTC_CCCAL_CCF_Msk           (0xFu << PTC_CCCAL_CCF_Pos)
#define PTC_CCCAL_CCF(value)        ((PTC_CCCAL_CCF_Msk & ((value) << PTC_CCCAL_CCF_Pos)))
#define PTC_CCCAL_CCC_Pos           8            /**< \brief (PTC_CCCAL) Compensation Capacitor Coarse Value */
#define PTC_CCCAL_CCC_Msk           (0xFu << PTC_CCCAL_CCC_Pos)
#define PTC_CCCAL_CCC(value)        ((PTC_CCCAL_CCC_Msk & ((value) << PTC_CCCAL_CCC_Pos)))
#define PTC_CCCAL_CCR_Pos           12           /**< \brief (PTC_CCCAL) Compensation Capacitor Rough Value */
#define PTC_CCCAL_CCR_Msk           (0x3u << PTC_CCCAL_CCR_Pos)
#define PTC_CCCAL_CCR(value)        ((PTC_CCCAL_CCR_Msk & ((value) << PTC_CCCAL_CCR_Pos)))
#define PTC_CCCAL_MASK              0x3FFFu      /**< \brief (PTC_CCCAL) MASK Register */

/* -------- PTC_CICAL : (PTC Offset: 0x1A) (R/W  8) CTS Integrator Capacitor Calibration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  CIF:4;            /*!< bit:  0.. 3  Integration Capacitor Fine Value   */
    uint8_t  CIC:2;            /*!< bit:  4.. 5  Integration Capacitor Coarse Value */
    uint8_t  :2;               /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CICAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CICAL_OFFSET            0x1A         /**< \brief (PTC_CICAL offset) CTS Integrator Capacitor Calibration Register */
#define PTC_CICAL_RESETVALUE        0x00         /**< \brief (PTC_CICAL reset_value) CTS Integrator Capacitor Calibration Register */

#define PTC_CICAL_CIF_Pos           0            /**< \brief (PTC_CICAL) Integration Capacitor Fine Value */
#define PTC_CICAL_CIF_Msk           (0xFu << PTC_CICAL_CIF_Pos)
#define PTC_CICAL_CIF(value)        ((PTC_CICAL_CIF_Msk & ((value) << PTC_CICAL_CIF_Pos)))
#define PTC_CICAL_CIC_Pos           4            /**< \brief (PTC_CICAL) Integration Capacitor Coarse Value */
#define PTC_CICAL_CIC_Msk           (0x3u << PTC_CICAL_CIC_Pos)
#define PTC_CICAL_CIC(value)        ((PTC_CICAL_CIC_Msk & ((value) << PTC_CICAL_CIC_Pos)))
#define PTC_CICAL_MASK              0x3Fu        /**< \brief (PTC_CICAL) MASK Register */

/* -------- PTC_CTSRS : (PTC Offset: 0x1B) (R/W  8) CTS Resistor Selection Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  RSEL:2;           /*!< bit:  0.. 1  Resistor Select                    */
    uint8_t  :6;               /*!< bit:  2.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSRS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

