zhengwang721/ASF/sam0/utils/cmsis/samd21/include/component/component_ptc.h
#define PTC_CTSRS_OFFSET            0x1B         /**< \brief (PTC_CTSRS offset) CTS Resistor Selection Register */
#define PTC_CTSRS_RESETVALUE        0x00         /**< \brief (PTC_CTSRS reset_value) CTS Resistor Selection Register */

#define PTC_CTSRS_RSEL_Pos          0            /**< \brief (PTC_CTSRS) Resistor Select */
#define PTC_CTSRS_RSEL_Msk          (0x3u << PTC_CTSRS_RSEL_Pos)
#define PTC_CTSRS_RSEL(value)       ((PTC_CTSRS_RSEL_Msk & ((value) << PTC_CTSRS_RSEL_Pos)))
#define PTC_CTSRS_MASK              0x03u        /**< \brief (PTC_CTSRS) MASK Register */

/* -------- PTC_RESULT : (PTC Offset: 0x1C) (R/W 16) Conversion Result Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t RES:16;           /*!< bit:  0..15  Result                             */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_RESULT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_RESULT_OFFSET           0x1C         /**< \brief (PTC_RESULT offset) Conversion Result Register */
#define PTC_RESULT_RESETVALUE       0x0000       /**< \brief (PTC_RESULT reset_value) Conversion Result Register */

#define PTC_RESULT_RES_Pos          0            /**< \brief (PTC_RESULT) Result */
#define PTC_RESULT_RES_Msk          (0xFFFFu << PTC_RESULT_RES_Pos)
#define PTC_RESULT_RES(value)       ((PTC_RESULT_RES_Msk & ((value) << PTC_RESULT_RES_Pos)))
#define PTC_RESULT_MASK             0xFFFFu      /**< \brief (PTC_RESULT) MASK Register */

/* -------- PTC_CTSCTRLB : (PTC Offset: 0x20) (R/W  8) CTS Control Register B -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  :2;               /*!< bit:  0.. 1  Reserved                           */
    uint8_t  CTSLP:1;          /*!< bit:      2  CTS Low Power Mode                 */
    uint8_t  :1;               /*!< bit:      3  Reserved                           */
    uint8_t  CTSM:4;           /*!< bit:  4.. 7  CTS Mode                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_CTSCTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_CTSCTRLB_OFFSET         0x20         /**< \brief (PTC_CTSCTRLB offset) CTS Control Register B */
#define PTC_CTSCTRLB_RESETVALUE     0x00         /**< \brief (PTC_CTSCTRLB reset_value) CTS Control Register B */

#define PTC_CTSCTRLB_CTSLP_Pos      2            /**< \brief (PTC_CTSCTRLB) CTS Low Power Mode */
#define PTC_CTSCTRLB_CTSLP          (0x1u << PTC_CTSCTRLB_CTSLP_Pos)
#define PTC_CTSCTRLB_CTSM_Pos       4            /**< \brief (PTC_CTSCTRLB) CTS Mode */
#define PTC_CTSCTRLB_CTSM_Msk       (0xFu << PTC_CTSCTRLB_CTSM_Pos)
#define PTC_CTSCTRLB_CTSM(value)    ((PTC_CTSCTRLB_CTSM_Msk & ((value) << PTC_CTSCTRLB_CTSM_Pos)))
#define PTC_CTSCTRLB_MASK           0xF4u        /**< \brief (PTC_CTSCTRLB) MASK Register */

/* -------- PTC_WINCCTRL : (PTC Offset: 0x21) (R/W  8) Window Comparator Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint8_t  WINCM:3;          /*!< bit:  0.. 2  Window Comparator Mode             */
    uint8_t  :5;               /*!< bit:  3.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} PTC_WINCCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_WINCCTRL_OFFSET         0x21         /**< \brief (PTC_WINCCTRL offset) Window Comparator Control Register */
#define PTC_WINCCTRL_RESETVALUE     0x00         /**< \brief (PTC_WINCCTRL reset_value) Window Comparator Control Register */

#define PTC_WINCCTRL_WINCM_Pos      0            /**< \brief (PTC_WINCCTRL) Window Comparator Mode */
#define PTC_WINCCTRL_WINCM_Msk      (0x7u << PTC_WINCCTRL_WINCM_Pos)
#define PTC_WINCCTRL_WINCM(value)   ((PTC_WINCCTRL_WINCM_Msk & ((value) << PTC_WINCCTRL_WINCM_Pos)))
#define PTC_WINCCTRL_MASK           0x07u        /**< \brief (PTC_WINCCTRL) MASK Register */

/* -------- PTC_WCHT : (PTC Offset: 0x24) (R/W 16) Window Comparator High Threshold Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t WCHT:16;          /*!< bit:  0..15  Window Comparator High Threshold   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_WCHT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_WCHT_OFFSET             0x24         /**< \brief (PTC_WCHT offset) Window Comparator High Threshold Register */
#define PTC_WCHT_RESETVALUE         0x0000       /**< \brief (PTC_WCHT reset_value) Window Comparator High Threshold Register */

#define PTC_WCHT_WCHT_Pos           0            /**< \brief (PTC_WCHT) Window Comparator High Threshold */
#define PTC_WCHT_WCHT_Msk           (0xFFFFu << PTC_WCHT_WCHT_Pos)
#define PTC_WCHT_WCHT(value)        ((PTC_WCHT_WCHT_Msk & ((value) << PTC_WCHT_WCHT_Pos)))
#define PTC_WCHT_MASK               0xFFFFu      /**< \brief (PTC_WCHT) MASK Register */

/* -------- PTC_WCLT : (PTC Offset: 0x26) (R/W 16) Window Comparator Low Threshold Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint16_t WCLT:16;          /*!< bit:  0..15  Window Comparator Low Threshold    */
  } bit;                       /*!< Structure used for bit  access                  */
  uint16_t reg;                /*!< Type      used for register access              */
} PTC_WCLT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PTC_WCLT_OFFSET             0x26         /**< \brief (PTC_WCLT offset) Window Comparator Low Threshold Register */
#define PTC_WCLT_RESETVALUE         0x0000       /**< \brief (PTC_WCLT reset_value) Window Comparator Low Threshold Register */

