zhengwang721/ASF/sam0/utils/cmsis/samd21/include/component/component_ptc.h
#define PTC_WCLT_WCLT_Pos           0            /**< \brief (PTC_WCLT) Window Comparator Low Threshold */
#define PTC_WCLT_WCLT_Msk           (0xFFFFu << PTC_WCLT_WCLT_Pos)
#define PTC_WCLT_WCLT(value)        ((PTC_WCLT_WCLT_Msk & ((value) << PTC_WCLT_WCLT_Pos)))
#define PTC_WCLT_MASK               0xFFFFu      /**< \brief (PTC_WCLT) MASK Register */

/** \brief PTC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  __IO PTC_CTRLA_Type            CTRLA;       /**< \brief Offset: 0x00 (R/W  8) Control Register A */
  __I  PTC_STATUS_Type           STATUS;      /**< \brief Offset: 0x01 (R/   8) Status Register */
       RoReg8                    Reserved1[0x2];
  __IO PTC_CTRLB_Type            CTRLB;       /**< \brief Offset: 0x04 (R/W  8) Control Register B */
  __IO PTC_EVCTRL_Type           EVCTRL;      /**< \brief Offset: 0x05 (R/W  8) Event Control Register */
       RoReg8                    Reserved2[0x2];
  __IO PTC_INTENCLR_Type         INTENCLR;    /**< \brief Offset: 0x08 (R/W  8) Interrupt Enable Clear Register */
  __IO PTC_INTENSET_Type         INTENSET;    /**< \brief Offset: 0x09 (R/W  8) Interrupt Enable Set Register */
  __IO PTC_INTFLAG_Type          INTFLAG;     /**< \brief Offset: 0x0A (R/W  8) Interrupt Flag Status and Clear Register */
       RoReg8                    Reserved3[0x1];
  __IO PTC_CTSCTRLA_Type         CTSCTRLA;    /**< \brief Offset: 0x0C (R/W  8) CTS Control Register A */
  __IO PTC_CTSCTRLC_Type         CTSCTRLC;    /**< \brief Offset: 0x0D (R/W  8) CTS Control Register C */
       RoReg8                    Reserved4[0x2];
  __IO PTC_YSEL_Type             YSEL;        /**< \brief Offset: 0x10 (R/W 16) Y Line Select Register */
  __IO PTC_XSEL_Type             XSEL;        /**< \brief Offset: 0x12 (R/W 16) X Line Select Register */
  __IO PTC_YEN_Type              YEN;         /**< \brief Offset: 0x14 (R/W 16) Y Line Enable Register */
  __IO PTC_XEN_Type              XEN;         /**< \brief Offset: 0x16 (R/W 16) X Line Enable Register */
  __IO PTC_CCCAL_Type            CCCAL;       /**< \brief Offset: 0x18 (R/W 16) CTS Compensation Capacitor Calibration Register */
  __IO PTC_CICAL_Type            CICAL;       /**< \brief Offset: 0x1A (R/W  8) CTS Integrator Capacitor Calibration Register */
  __IO PTC_CTSRS_Type            CTSRS;       /**< \brief Offset: 0x1B (R/W  8) CTS Resistor Selection Register */
  __IO PTC_RESULT_Type           RESULT;      /**< \brief Offset: 0x1C (R/W 16) Conversion Result Register */
       RoReg8                    Reserved5[0x2];
  __IO PTC_CTSCTRLB_Type         CTSCTRLB;    /**< \brief Offset: 0x20 (R/W  8) CTS Control Register B */
  __IO PTC_WINCCTRL_Type         WINCCTRL;    /**< \brief Offset: 0x21 (R/W  8) Window Comparator Control Register */
       RoReg8                    Reserved6[0x2];
  __IO PTC_WCHT_Type             WCHT;        /**< \brief Offset: 0x24 (R/W 16) Window Comparator High Threshold Register */
  __IO PTC_WCLT_Type             WCLT;        /**< \brief Offset: 0x26 (R/W 16) Window Comparator Low Threshold Register */
} Ptc;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_PTC_COMPONENT_ */
